<?php

    //เขียนโปรแกรมพิมพ์เลข 1 ถึง 10
    for($x = 1;$x <= 10;$x++){
        echo $x." ";
    }

    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 10 ถึง 0


    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 2 ถึง 50 โดยให้เพิ่มขึ้นทีละ 2
    //เช่น 2 4 6 8 10 ..... 50
    for($y = 2;$y <= 50; $y = ($y + 2)){
        echo $y." ";
    }

    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 100 ถึง 5 โดยให้ลดขึ้นทีละ 5
    //เช่น 100 95 90 85 80 .... 5


    echo "<hr>";
    //สูตรคูณแม่ 199
    //199 x 1 = 199
?>