<?php

    //เขียนโปรแกรมพิมพ์เลข 1 ถึง 10
    $num = 1;
    while($num <= 10){ 
        echo $num;
        //echo "<br>";
        //$num = $num + 1; 
        $num++;
    }
    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 10 ถึง 0
    $x = 10;
    while($num >= 0){ 
        echo $num;
        $num--;
    }
    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 2 ถึง 50 โดยให้เพิ่มขึ้นทีละ 2
    //เช่น 2 4 6 8 10 ..... 50
    $y = 2;
    while($y <= 50){ 
        echo $y." ";
        $y = $y + 2;
    }
    echo "<hr>";
    //เขียนโปรแกรมพิมพ์เลข 100 ถึง 5 โดยให้ลดขึ้นทีละ 5
    //เช่น 100 95 90 85 80 .... 5
    $z = 100;
    while($z >= 5){ 
        echo $z." ";
        $z = $z - 5;
    }
    echo "<hr>";
    $m = 1;
    $n = 6;
    echo "สูตรคูณแม่ 6"."<br>";
    while($m <= 12){
        echo "6 x ".$m." = ".$n."<br>";
        $m++;
        $n = $n + 6;
    }





?>